#########################################################
#    		     	VALIDATION MESSAGES
#########################################################
# JSR303 Messages
javax.validation.constraints.Size.message= \u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0627\u0644\u062D\u0642\u0644 \u0628\u064A\u0646 {min} \u0648 {max}
javax.validation.constraints.Max.message=\u064A\u062A\u062C\u0627\u0648\u0632 \u0627\u0644\u062D\u0642\u0644 \u0627\u0644\u062D\u062F \u0627\u0644\u0623\u0642\u0635\u0649 \u0644\u0644\u0642\u064A\u0645\u0629
javax.validation.constraints.NotNull.message=\u064A\u062C\u0628 \u0623\u0644\u0627 \u064A\u0643\u0648\u0646 \u0627\u0644\u062D\u0642\u0644 \u0641\u0627\u0631\u063A\u0627
javax.validation.constraints.Past.message=\u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0627\u0644\u062A\u0627\u0631\u064A\u062E \u0641\u064A \u0627\u0644\u0645\u0627\u0636\u064A
javax.validation.constraints.Pattern.message=\u0644\u0627 \u064A\u062D\u062A\u0631\u0645 \u0627\u0644\u062D\u0642\u0644 \u0627\u0644\u0646\u0645\u0637 \u0627\u0644\u0645\u0637\u0644\u0648\u0628
# DCC Messages
Unique=\u0627\u0644\u0642\u064A\u0645\u0629 \u0627\u0644\u062A\u064A \u0623\u062F\u062E\u0644\u062A\u0647\u0627 \u0647\u064A \u0642\u064A\u062F \u0627\u0644\u0627\u0633\u062A\u062E\u062F\u0627\u0645
FieldMatch=\u0647\u0630\u0627 \u0627\u0644\u062D\u0642\u0644 \u063A\u064A\u0631 \u0645\u062A\u0637\u0627\u0628\u0642
Nin=\u0635\u062D\u064A\u062D \u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0631\u0642\u0645 \u0647\u0648\u064A\u0629 \u0648\u0637\u0646\u064A\u0629
IqamaNumber=\u0635\u062D\u064A\u062D \u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0631\u0642\u0645 \u0625\u0642\u0627\u0645\u0629
MobileNumber=\u0635\u062D\u064A\u062D \u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0631\u0642\u0645 \u062C\u0648\u0627\u0644
SafeFile=\u064A\u0631\u062C\u0649 \u062A\u062D\u0645\u064A\u0644 \u0645\u0644\u0641 \u0635\u0627\u0644\u062D
Password=\u064A\u062C\u0628 \u0623\u0646 \u062A\u0643\u0648\u0646 \u0643\u0644\u0645\u0629 \u0627\u0644\u0645\u0631\u0648\u0631 \u0645\u0632\u064A\u062C\u064B\u0627 \u0645\u0646 \u0627\u0644\u0623\u062D\u0631\u0641 \u0627\u0644\u0633\u0641\u0644\u0649 / \u0627\u0644\u0639\u0644\u064A\u0627 / \u0623\u0631\u0642\u0627\u0645 / \u0627\u0644\u062E\u0627\u0635\u0629
typeMismatch=\u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0627\u0644\u0645\u064F\u062F\u062E\u0644 \u0645\u062A\u0646\u0627\u0633\u0628 \u0645\u0639 \u0627\u0644\u062D\u0642\u0644
# Hibernate Validator Messages
org.hibernate.validator.constraints.Email.message=\u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0627\u0644\u062D\u0642\u0644 \u0641\u064A \u0634\u0643\u0644 \u0628\u0631\u064A\u062F \u0625\u0644\u0643\u062A\u0631\u0648\u0646\u064A
org.hibernate.validator.constraints.NotBlank.message=\u064A\u062C\u0628 \u0623\u0644\u0627 \u064A\u0643\u0648\u0646 \u0627\u0644\u062D\u0642\u0644 \u0641\u0627\u0631\u063A\u0627
org.hibernate.validator.constraints.NotEmpty.message=\u064A\u062C\u0628 \u0623\u0644\u0627 \u064A\u0643\u0648\u0646 \u0627\u0644\u062D\u0642\u0644 \u0641\u0627\u0631\u063A\u0627
org.hibernate.validator.constraints.Range.message=\u064A\u062C\u0628 \u0623\u0644\u0627 \u064A\u0643\u0648\u0646 \u0627\u0644\u062D\u0642\u0644 \u062E\u0627\u0631\u062C \u0627\u0644\u0646\u0637\u0627\u0642 \u0627\u0644\u0645\u0633\u0645\u0648\u062D

#########################################################
#    		   DATA VALIDATION MESSAGES
#########################################################
data.validation.field.required=\u064A\u062C\u0628 \u0623\u0644\u0627 \u064A\u0643\u0648\u0646 \u0627\u0644\u062D\u0642\u0644 \u0641\u0627\u0631\u063A\u064B\u0627
data.validation.field.dependent=\u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u062D\u0642\u0644 \u0648\u0627\u062D\u062F \u0639\u0644\u0649 \u0627\u0644\u0623\u0642\u0644 \u063A\u064A\u0631 \u0641\u0627\u0631\u063A\u064D
data.validation.field.type.invalid=\u0646\u0648\u0639 \u0627\u0644\u062D\u0642\u0644 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
data.validation.date.gregorian.format=\u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0627\u0644\u062D\u0642\u0644 \u062A\u0627\u0631\u064A\u062E\u0627 \u0645\u064A\u0644\u0627\u062F\u064A\u0627 \u0635\u0627\u0644\u062D\u0627
data.validation.date.gregorian.out.of.range=\u0627\u0644\u062A\u0627\u0631\u064A\u062E \u0627\u0644\u0645\u064A\u0644\u0627\u062F\u064A \u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0636\u0645\u0646 \u0627\u0644\u0646\u0637\u0627\u0642
data.validation.date.hijri.format=\u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0627\u0644\u062D\u0642\u0644 \u062A\u0627\u0631\u064A\u062E\u0627 \u0647\u062C\u0631\u064A\u0627 \u0635\u0627\u0644\u062D\u0627
data.validation.date.hijri.out.of.range=\u0627\u0644\u062A\u0627\u0631\u064A\u062E \u0627\u0644\u0647\u062C\u0631\u064A \u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0636\u0645\u0646 \u0627\u0644\u0646\u0637\u0627\u0642

validation.data.constraints.msg.20001=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0642\u064A\u0645\u0629 \u0627\u0644\u062D\u0642\u0644. \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0646 \u064A\u0643\u0648\u0646 \u0627\u0644\u062D\u0642\u0644 \u0641\u0627\u0631\u063A\u0627
validation.data.constraints.msg.20002=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0623\u062D\u062F \u0627\u0644\u062D\u0642\u0648\u0644, \u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0643\u0644\u0627\u0647\u0645\u0627 \u0641\u0627\u0631\u063A\u0627
validation.data.constraints.msg.20003=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0642\u064A\u0645\u0629 \u0645\u0646 \u0627\u0644\u062D\u0631\u0648\u0641 \u0627\u0644\u0645\u0642\u0628\u0648\u0644\u0629
validation.data.constraints.msg.20004=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0642\u064A\u0645\u0629 \u0635\u062D\u064A\u062D\u0629. \u0637\u0648\u0644 \u0627\u0644\u062D\u0642\u0644 \u064A\u062C\u0628 \u0627\u0646 \u064A\u0643\u0648\u0646 \u0636\u0645\u0646 \u0627\u0644\u0646\u0637\u0627\u0642 \u0627\u0644\u0645\u0633\u0645\u0648\u062D
validation.data.constraints.msg.20005=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0642\u064A\u0645\u0629 \u0635\u062D\u064A\u062D\u0629 \u062A\u062A\u0646\u0627\u0633\u0628 \u0645\u0639 \u0627\u0644\u062A\u0646\u0633\u064A\u0642 \u0627\u0644\u0645\u0633\u0645\u0648\u062D \u0644\u0644\u062D\u0642\u0644
validation.data.constraints.msg.20006=\u0627\u0644\u0631\u062C\u0627\u0621 \u0623\u062F\u062E\u0627\u0644 \u0642\u064A\u0645\u0629 \u0635\u062D\u064A\u062D\u0629 \u0645\u0646 \u0642\u0627\u0626\u0645\u0629 \u0627\u0644\u0642\u064A\u0645 \u0627\u0644\u0645\u0633\u0645\u0648\u062D\u0629
validation.data.constraints.msg.20007=\u0627\u0644\u062A\u0627\u0631\u064A\u062E \u0627\u0644\u0645\u062F\u062E\u0644 \u063A\u064A\u0631 \u0635\u062D\u064A\u062D. \u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0627\u0644\u062A\u0627\u0631\u064A\u062E \u0636\u0645\u0646 \u0627\u0644\u0646\u0637\u0627\u0642 \u0627\u0644\u0645\u0633\u0645\u0648\u062D
validation.data.constraints.msg.20008=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u062A\u0627\u0631\u064A\u062E \u0635\u062D\u064A\u062D \u0645\u0646 \u0636\u0645\u0646 \u0627\u0644\u0646\u0637\u0627\u0642 \u0627\u0644\u0645\u0633\u0645\u0648\u062D
validation.data.constraints.msg.20009=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0645\u0644\u0641 \u0635\u062D\u064A\u062D. \u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u062D\u062C\u0645 \u0627\u0644\u0645\u0644\u0641 \u0623\u0642\u0644 \u0645\u0646 \u0627\u0642\u0635\u0649 \u062D\u062C\u0645 \u0645\u0633\u0645\u0648\u062D
validation.data.constraints.msg.20010=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0642\u064A\u0645\u0629 \u0635\u062D\u064A\u062D\u0629. \u0644\u0627\u064A\u0645\u0643\u0646 \u062A\u0643\u0631\u0627\u0631 \u0627\u0644\u0642\u064A\u0645\u0629 \u0641\u064A \u0646\u0641\u0633 \u0627\u0644\u0637\u0644\u0628
validation.data.constraints.msg.20011=\u0642\u064A\u0645\u0629 \u0627\u0644\u0645\u0648\u0633\u0645 \u0627\u0644\u0645\u062D\u062F\u062F \u063A\u064A\u0631 \u0635\u062D\u064A\u062D\u0629
validation.data.constraints.msg.20012=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0631\u0642\u0645 \u0647\u0648\u064A\u0629 \u0635\u062D\u064A\u062D
validation.data.constraints.msg.20013=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0623\u062D\u0631\u0641 \u0639\u0631\u0628\u064A\u0629 \u0641\u0642\u0637
validation.data.constraints.msg.20014=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0623\u062D\u0631\u0641 \u0625\u0646\u062C\u0644\u064A\u0632\u064A\u0629 \u0641\u0642\u0637

validation.data.constraints.msg.30001=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0642\u064A\u0645\u0629 \u0635\u062D\u064A\u062D\u0629. \u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u0643\u0631\u0627\u0631 \u0627\u0644\u0642\u064A\u0645\u0629 \u0645\u0639 \u0627\u0644\u0633\u062C\u0644\u0627\u062A \u0627\u0644\u0645\u0633\u062C\u0644\u0629 \u0633\u0627\u0628\u0642\u0627
validation.data.constraints.msg.30002=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0628\u064A\u0627\u0646\u0627\u062A \u0633\u062C\u0644 \u0635\u062D\u064A\u062D\u0629. \u0627\u0644\u0633\u062C\u0644 \u0627\u0644\u0641\u0631\u0639\u064A \u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0644\u0647 \u0633\u062C\u0644 \u0631\u0626\u064A\u0633\u064A \u0648\u0630\u0644\u0643 \u0644\u0644\u0631\u0628\u0637 \u0627\u0644\u0635\u062D\u064A\u062D \u0628\u064A\u0646\u0647\u0645\u0627
validation.data.constraints.msg.30003=\u0627\u0644\u0631\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0628\u064A\u0627\u0646\u0627\u062A \u0633\u062C\u0644 \u0635\u062D\u064A\u062D\u0629. \u0627\u0644\u0633\u062C\u0644 \u0627\u0644\u0641\u0631\u0639\u064A \u0644\u0644\u062A\u0627\u0628\u0639 \u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0644\u0647 \u0633\u062C\u0644 \u0631\u0626\u064A\u0633\u064A \u0648\u0630\u0644\u0643 \u0644\u0644\u0631\u0628\u0637 \u0627\u0644\u0635\u062D\u064A\u062D \u0628\u064A\u0646\u0647\u0645\u0627


#########################################################
#    					GENERAL MESSAGES
#########################################################


#########################################################
# 		     REGISTRATION MESSAGES
#########################################################
otp.login.sms.notification=\u0627\u0644\u0631\u062C\u0627\u0621 \u0627\u0633\u062A\u062E\u062F\u0627\u0645 {0} \u0643\u0631\u0645\u0632 \u0627\u0644\u062A\u0641\u0639\u064A\u0644 \u0644\u0645\u062A\u0627\u0628\u0639\u0629 \u062A\u0633\u062C\u064A\u0644 \u0627\u0644\u062F\u062E\u0648\u0644 \u0627\u0644\u062E\u0627\u0635 \u0628\u0643.
reset.password.sms.notification=تلقينا طلب إعادة تعيين كلمة المرور إستعمل كلمة المرور الموقتة التالية {0} للدخول على النظام ونود إحاطتكم بإنه سيتطلب منكم تعديلها عند تسجيل الدخول.
user.mngt.new.user.sms.notification=\u062A\u0645 \u0627\u0646\u0634\u0627\u0621 \u062D\u0633\u0627\u0628 \u0645\u0633\u062A\u062E\u062F\u0645. \u062A\u0645 \u0627\u0631\u0633\u0627\u0644 \u0627\u0633\u0645 \u0627\u0644\u0645\u0633\u062A\u062E\u062F\u0645 \u0625\u0644\u0649 \u0628\u0631\u064A\u062F\u0643 \u0627\u0644\u0627\u0644\u0643\u062A\u0631\u0648\u0646\u064A \u0648 \u0643\u0644\u0645\u0629 \u0627\u0644\u0645\u0631\u0648\u0631 \u0627\u0644\u0645\u0624\u0642\u062A\u0629 \u0647\u064A {0}


